'''
Шаг 1. Объявите функцию read_columns(matrix), где matrix --> список списков символов
(прямоугольная таблица).
Шаг 2. Сформируйте строку, проходя по столбцам слева направо, а внутри каждого столбца
по строкам сверху вниз: берите символы как matrix[i][j].
Шаг 3. Верните полученную строку.
Функцию не вызывать, ничего не печатать, используйте только return.

🧪 Пример ввод

matrix = [
    ['П', 'р', 'и'],
    ['в', 'е', 'т'],
    ['!', '!', '!']
]

🧪 Пример вывод

Пв!ре!ит!
'''


def read_columns(matrix: list[list[str]]) -> str:
    result = ''
    row, col = len(matrix), len(matrix[0])

    for i in range(col):
        for j in range(row):
            result += matrix[j][i]

    return result

matrix = [
    ['П', 'р', 'и'],
    ['в', 'е', 'т'],
    ['!', '!', '!']
]
matrix1 = [
    ['А', 'б', 'в', 'г'],
    ['д', 'е', 'ж', 'з'],
    ['и', 'й', 'к', 'л']
]
matrix2 = [
    ['Х', 'е', 'л'],
    ['л', 'о', ' '],
    [' ', ' ', 'м'],
    ['м', 'и', 'р']
]
matrix3 = [
    ['Ш', 'и', 'ф'],
    ['р', 'о', 'в'],
    ['а', 'я', 'с'],
    ['!', '!', '!']
]

print(read_columns(matrix))
print(read_columns(matrix1))
print(read_columns(matrix2))
