'''В программе задан список cities.
Считайте два целых числа (каждое с новой строки):

    начальный индекс start,

    конечный индекс end.

Отсортируйте только подсписок cities[start:end] (как в Python-срезах:
индекс start включается, end --> не включается, индексация с нуля).
Остальная часть списка должна остаться без изменений.

Выведите итог в формате:

Список городов с отсортированным срезом:
1. <город_1>
2. <город_2>
...

Запрещено использовать функцию sorted().
'''

# Данный список из 131 города
cities = [
    "Москва", "Петербург", "Томск", "Казань", "Екатеринбург", "Новосибирск",
    "Сочи", "Калуга", "Воронеж", "Уфа",
    "Самара", "Краснодар", "Челябинск", "Пермь", "Нижний Новгород",
    "Красноярск", "Саратов", "Тверь", "Рим", "Милан",
    "Барселона", "Мадрид", "Лондон", "Берлин", "Амстердам", "Париж", "Вена",
    "Лиссабон", "Прага", "Брюссель",
    "Афины", "Будапешт", "Мюнхен", "Римини", "Стамбул", "Тегеран", "Каир",
    "Токио", "Пекин", "Шанхай", "Сеул",
    "Сидней", "Мельбурн", "Нью-Йорк", "Чикаго", "Лос-Анджелес", "Калифорния",
    "Квебек", "Монреаль", "Торонто",
    "Сан-Франциско", "Мехико", "Буэнос-Айрес", "Рио-де-Жанейро", "Сан-Паулу",
    "Канкун", "Лима", "Кито", "Каракас",
    "Монтевидео", "Тегусигальпа", "Богота", "Сантьяго", "Кито", "Лагос",
    "Йоханнесбург", "Кейптаун", "Лагос",
    "Гонконг", "Тайбэй", "Манила", "Бангкок", "Дубай", "Куала-Лумпур",
    "Сингапур", "Бали", "Мумбаи", "Дели",
    "Калкутта", "Гоа", "Коломбо", "Мале", "Лагос", "Тбилиси", "Ереван", "Баку",
    "Ташкент", "Алма-Ата",
    "Минск", "Кишинёв", "Вильнюс", "Бухарест", "Таллинн", "Рига", "Лондон",
    "Мадрид", "Рим", "Берлин",
    "Штутгарт", "Зальцбург", "Пиза", "Мюнхен", "София", "Подгорица", "Београд",
    "Будапешт", "Братислава", "Лиссабон",
    "Париж", "Барселона", "Лиссабон", "Дублин", "Стокгольм", "Осло",
    "Копенгаген", "Хельсинки", "Лион", "Марсель",
    "Тулуза", "Лилль", "Монпелье", "Ницца", "Бордо", "Руан", "Тур", "Ажен",
    "Шартр", "Морле", "Гавр", "Лимож", "Клермон-Ферран"
]

# Считываем начальный и конечный индексы среза
start, end = int(input()), int(input())

# Выделяем три части списка:
# - start_part: элементы до среза
# - middle_part: срез, который нужно отсортировать
# - end_part: элементы после среза
start_part = cities[:start]
middle_part = cities[start:end]
end_part = cities[end:]

# Создаем пустой список для отсортированной части
sorted_part = []

# Сортируем middle_part вручную, используя min() и удаление минимального элемента
while middle_part:
    city = min(middle_part)  # Находим минимальный элемент
    sorted_part.append(city)  # Добавляем его в результат
    middle_part.remove(city)  # Удаляем из исходного подсписка

# Собираем финальный список: начало + отсортированная часть + конец
result = start_part + sorted_part + end_part

# Выводим заголовок
print('Список городов с отсортированным срезом:')

# Выводим каждый город с нумерацией, начиная с 1
for i in range(1, len(result) + 1):
    print(f'{i}. {result[i - 1]}')




